# Pandas 

Hello everyone! This notebook will discuss `Pandas`. `Pandas` is a `Python` library for specialized data structures and data analysis methods. What makes `Pandas` different from `Numpy` is the use of axis labels for its data structures.

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

### Series
A `Series` is very similar to a `Numpy` array, but has axis labels. This allows `Series` to be indexed by a label. 

You can convert a list, `Numpy` array, or dictionary to a `Series`:

In [2]:
labels = ['a','b','c']
values = [1, 2, 3]
array = np.array([1, 2, 3])
d = {'a':1,'b':2,'c':3}

In [3]:
pd.Series(data=values)

0    1
1    2
2    3
dtype: int64

In [4]:
pd.Series(data=values, index=labels)

a    1
b    2
c    3
dtype: int64

In [5]:
pd.Series(values, labels)

a    1
b    2
c    3
dtype: int64

In [6]:
pd.Series(array)

0    1
1    2
2    3
dtype: int32

In [6]:
pd.Series(array, labels)

a    1
b    2
c    3
dtype: int32

In [7]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

##### Using an index

`Pandas` can leverage indexes for fast look ups of information similar to how a hash table would work.

In [8]:
ser1 = pd.Series([1,2,3,4], index = ['USA', 'Germany', 'USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [9]:
ser2 = pd.Series([1,2,5,4], index = ['USA', 'Germany', 'Italy', 'Japan'])    
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [10]:
ser1['USA']

1

Operations are then also done based off of index:

In [11]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

---

### Dataframes
`DataFrame` objects can be thought of as a group of `Series` objects put together to share the same index.

In [12]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

##### Selection and Indexing

In [14]:
df['W'] # Indexing column values

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [15]:
df[['W', 'Z']] # Indexing multiple columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [16]:
type(df['W']) # Dataframe columns are just Series objects

pandas.core.series.Series

##### Creating a new column
To create a new column, just "index" your dataframe with the name of the new column, then assign values to it.

In [13]:
df['new'] = df['W'] + df['Y'] 
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

##### Removing Columns

In [20]:
# The axis parameter will allow you to drop rows (axis=0) or columns (axis=1)
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
# Dont forget to reassign the dataframe, otherwise the changes will not be reflected. 
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [23]:
# axis 1 -> vertical
# axis 0 -> horizontal

df.drop('new', axis=1, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df.drop('E', axis=0) # This is dropping values via rows

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

##### Selecting Rows

In [25]:
df.loc['A'] # Based on the index

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [26]:
df.iloc[2] # Based on the position of the label

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [27]:
df.loc['B', 'Y'] # Based on a subset of rows and columns

-0.8480769834036315

In [28]:
df.loc[['A','B'],['W','Y']] # Based on a subset of rows and columns

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

##### Conditional Selection

In [29]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [31]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df[df['W'] > 0]

# removed the row that didn't satisfy the condition

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [33]:
df[df['W'] > 0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [34]:
df[df['W'] > 0][['Y', 'X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [35]:
df[(df['W'] > 0) & (df['Y'] > 1)] # Use conditionals like OR (| pipes) or AND (& ampersand)

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

##### Resetting the index

In [16]:
df.reset_index() # Reset to default 0, 1...n index

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.614819
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
2     C -2.018168  0.740122  0.528813 -0.589001 -1.489355
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
4     E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
newind = 'CA NY WY OR CO'.split()
df['States'] = newind
df

          W         X         Y         Z       new States
A  2.706850  0.628133  0.907969  0.503826  3.614819     CA
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959     NY
C -2.018168  0.740122  0.528813 -0.589001 -1.489355     WY
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542     OR
E  0.190794  1.978757  2.605967  0.683509  2.796762     CO

In [19]:
df.set_index('States') # not in-place

               W         X         Y         Z       new
States
CA      2.706850  0.628133  0.907969  0.503826  3.614819
NY      0.651118 -0.319318 -0.848077  0.605965 -0.196959
WY     -2.018168  0.740122  0.528813 -0.589001 -1.489355
OR      0.188695 -0.758872 -0.933237  0.955057 -0.744542
CO      0.190794  1.978757  2.605967  0.683509  2.796762

---

### Missing data

In [39]:
df = pd.DataFrame({
    'A':[1, 2, np.nan],
    'B':[5, np.nan, np.nan],
    'C':[1,2,3]
})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [40]:
df.dropna() # drops rows with NaN

     A    B  C
0  1.0  5.0  1

In [41]:
df.dropna(axis=1) # drops columns with NaN

   C
0  1
1  2
2  3

In [42]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [43]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

---

### Merging, Joining, and Concatenating

In [45]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [46]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [47]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

##### Concatenation
Concatenation combines dataframes with matching dimensions along the axis.

In [48]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [49]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

##### Merging
This kind of merging is similar to how you would merge SQL tables.

In [50]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [51]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})    
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [52]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [54]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [55]:
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [61]:
pd.merge(left, right, on=['key1', 'key2'])
# key 1 and key 2 have to match

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [62]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])
# if key 1 and key 2 match, they don't have to be added twice

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [59]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [60]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [63]:
pd.merge(left, right, how='right', on=['key1', 'key2'])
# match key 2

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [65]:
pd.merge(left, right, how='left', on=['key1', 'key2'])
# idk??

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

##### Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [66]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [67]:
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [68]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [69]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

---

### Pandas Operations

In [70]:
df = pd.DataFrame({
    'A':[1, 2, 3, 4],
    'B':[444, 555, np.nan, 444],
    'C':['abc', 'def', 'ghi', np.nan]
})
df

   A      B    C
0  1  444.0  abc
1  2  555.0  def
2  3    NaN  ghi
3  4  444.0  NaN

##### Unique Values

In [71]:
df['B'].unique()

array([444., 555.,  nan])

In [72]:
df['B'].nunique()

2

In [73]:
df['B'].value_counts()

444.0    2
555.0    1
Name: B, dtype: int64

##### Selecting Data

In [74]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['A']>2) & (df['B']==444)]
newdf

   A      B    C
3  4  444.0  NaN

##### Applying Functions

In [75]:
def times2(x):
    return x*2

In [76]:
df['A'].apply(times2)

0    2
1    4
2    6
3    8
Name: A, dtype: int64

In [77]:
df['C'].apply(len)

TypeError: object of type 'float' has no len()

In [79]:
df['A'].sum()

10

##### Removing a column inplace

In [82]:
del df['A']
df
# not recommended

KeyError: 'A'

##### Getting column and index names

In [83]:
df.columns

Index(['B', 'C'], dtype='object')

In [84]:
df.index

RangeIndex(start=0, stop=4, step=1)

##### Sorting

In [85]:
df.sort_values(by='B')

       B    C
0  444.0  abc
3  444.0  NaN
1  555.0  def
2    NaN  ghi

##### Handling null values

In [86]:
df.isnull()

       B      C
0  False  False
1  False  False
2   True  False
3  False   True

In [87]:
df.dropna() # Drop rows with NaN Values

       B    C
0  444.0  abc
1  555.0  def

In [88]:
df.fillna('FILLNAN')

         B        C
0      444      abc
1      555      def
2  FILLNAN      ghi
3      444  FILLNAN

##### Pivot tables

In [92]:
df = pd.DataFrame({
    'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B':['one', 'one', 'two', 'two', 'one', 'one'],
    'C':['x', 'y', 'x', 'y', 'x', 'y'],
    'D':[1, 3, 2, 5, 4, 1]
})
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [93]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

---

### Data input and output

In [94]:
df = pd.read_csv('yelp.csv')
df.head(3) # Use to check the first 3 rows

,business_id,date,review_id,stars,text,type,user_id,cool,useful,funny
0,9yKzy9PApeiPPOUJEtnvkg,1/26/11,fWKvX83p0-ka4JS3dc6E5A,5,My wife took me here on my birthday for breakf...,review,rLtl8ZkDX5vH5nAx9C3q5Q,2,5,0
1,ZRJwVLyzEJq1VAihDhYiow,7/27/11,IjZ33sJrzXqU-0X6U8NwyA,5,I have no idea why some people give bad review...,review,0a2KyEL0d3Yb1V6aivbIuQ,0,0,0
2,6oRAC4uyJCsJl1X0WZpVSA,6/14/12,IESLBzqUCLdSzSqm0eCSxQ,4,love the gyro plate. Rice is so good and I als...,review,0hT2KtfLiobPvh6cDC8JQg,0,1,0

---

### Exercise

##### Read `salaries.csv` as a dataframe called `sal`.

In [95]:
# Your answer
sal = pd.read_csv('salaries.csv')

##### Display the first 5 rows of `sal`.

In [96]:
# Your answer
sal.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,Gregory P Suhr,Chief of Police,319275.01,0.00,20007.06,86533.21,339282.07,425815.28,2013,NaN,San Francisco,NaN
1,2,Joanne M Hayes-White,"Chief, Fire Department",313686.01,0.00,23236.00,85431.39,336922.01,422353.40,2013,NaN,San Francisco,NaN
2,3,Samson Lai,"Battalion Chief, Fire Suppress",186236.42,131217.63,29648.27,57064.95,347102.32,404167.27,2013,NaN,San Francisco,NaN
3,4,Ellen G Moffatt,Asst Med Examiner,272855.51,23727.91,38954.54,66198.92,335537.96,401736.88,2013,NaN,San Francisco,NaN
4,5,Robert L Shaw,"Dep Dir for Investments, Ret",315572.01,0.00,0.00,82849.66,315572.01,398421.67,2013,NaN,San Francisco,NaN

##### What is the average `BasePay`?

In [99]:
# Your answer
sal['Benefits'].mean()

23829.076572089558

##### What is the job title of `JOSEPH DRISCOLL`?

In [167]:
# Your answer
# sal[sal['EmployeeName']=='Gregory P Suhr']['JobTitle']
new_sal = sal.set_index('EmployeeName')
new_sal.at['Samson  Lai','JobTitle']

'Battalion Chief, Fire Suppress'

##### How many unique job titles are there?

In [10]:
# Your answer

##### How many `Job Titles` were represented by only one person in 2013? (e.g. `Job Titles` with only one occurence in 2013?)

In [120]:
sal['JobTitle'].nunique()

1051

In [131]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts()==1)

202

In [132]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts())

37606